[
    {
        "company": "Freelance",
        "position": "Full Stack",
        "date": "jui 2020 - Present",
        "tasks": [
            "Develop everything related to the front-end of the sites using React or from scratch, make modification on the front-end and repairing errors.",
            "Develop everything related to the back-end of the sites, handle the databases and create API, Repairing errors, Add new features.",
            "Work in Fiverr, clients from pages in facebook."
        ]
    },
    {
        "company": "datagix",
        "position": "Full Stack",
        "date": "mars 2022 - mai 2022",
        "tasks": [
            "Redesign the front end of the company's website using WordPress https://www.datagix.com/",
            "I have developed Backend parts for new added systems at the customer's request, using Codeigniter and handling databases in MySql. The development of these additions was based on the previous code and functions helpers"
        ]
    },
    {
        "company": "Hackathons",
        "position": "Front-End",
        "date": "mars 2021 - ??",
        "tasks": [
            "\"Hackit\" - Naftal Challenge where we have provided a solution to reduce the amount of time people wait in a queue, using artificial intelligence to give you the station that will be quick for you.",
            "\"JunctionX\" - Is an innovative solution, A web application embedded in Techmology’s Moborne touch terminal. Used mainly in public large hospitals to assist patients through their journey."
        ]
    },
    {
        "company": "Micro Club",
        "position": "Front-End",
        "date": "nov 2018 - Present",
        "tasks": [
            "Participated in educational courses and bootcamps to learn all about the web and complete tasks",
            "I have participated in many competitions in web development which were dedicated to club members and competing with each other",
            "Work on the websites of an MGV event organized by the club",
            "I participated with a team of club members in the creation of the \"Government Complaints Platform\", called \"CiRM\", for the benefit of the \"Republic Mediator."
        ]
    },
    {
        "company": "School of AI",
        "position": "Technical",
        "date": "nov 2022 - Present",
        "tasks": [
            "Participate in artificial intelligence training courses",
            "Co-organizer of Datathon HAICK",
            "Co-organizer of INDABAX event"
        ]
    },
    {
        "company": "44 Tech Mackers",
        "position": "Leader IT",
        "date": "feb 2021 - jul 2021",
        "tasks": [
            "I was a supervisor of teaching and training students on how to create a project based on conception and the various skills among them POO, java, github, firebase, ..."
        ]
    }
]